<a href="https://colab.research.google.com/github/wfsilva-uea/coari/blob/master/northwind.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# create alchemy url connection from heroku
ALCHEMY_CONNECTION = 'postgresql+psycopg2://wbhryxespoclma:9bf9f3d993e77d3b92febfe4211bd2fd79adc421a5755381a67798005603800c@ec2-54-147-126-202.compute-1.amazonaws.com:5432/da01qrqols9c1s'

### Popular a base de dados do PostgreSQL no Heroku

In [ ]:
# install postgres binary lib
!pip install psycopg2-binary

# getting sql file to runtime
!npx degit wfsilva-uea/northwind/northwind.sql northwind.sql -f

In [38]:
# read sql file and store in variable
with open('northwind.sql', 'r') as sql_file:
  sql_content = sql_file.read()

# declare a new connection
from psycopg2 import connect

connection = connect (
  dbname='da01qrqols9c1s',
  user='wbhryxespoclma',
  host='ec2-54-147-126-202.compute-1.amazonaws.com',
  password='9bf9f3d993e77d3b92febfe4211bd2fd79adc421a5755381a67798005603800c'
)
with connection.cursor() as cursor:
  cursor.execute(sql_content)

### Consultas

In [2]:
# requirements
import pandas as pd
from sqlalchemy import create_engine

In [8]:
# create sql alchemy engine
engine = create_engine(ALCHEMY_CONNECTION, echo=False)

In [10]:
# 1. os 10 produtos mais caros
query = """
  select distinct 
    products.product_name as ten_most_expensive_products, 
    products.unit_price 
  from products 
  order by products.unit_price desc
"""
df = pd.read_sql_query(query, con=engine)
df.head(10)

  ten_most_expensive_products  unit_price
0               Côte de Blaye      263.50
1     Thüringer Rostbratwurst      123.79
2             Mishi Kobe Niku       97.00
3      Sir Rodney's Marmalade       81.00
4            Carnarvon Tigers       62.50
5        Raclette Courdavault       55.00
6       Manjimup Dried Apples       53.00
7              Tarte au sucre       49.30
8                 Ipoh Coffee       46.00
9           Rössle Sauerkraut       45.60

In [18]:
# 2. pedido trimestral
query = """
  select 
    customers.customer_id, 
    customers.company_name, 
    customers.city, 
    customers.country
  from customers 
  right join orders on customers.customer_id = orders.customer_id
  where orders.order_date between '1996-01-01' and '1996-12-31'
"""
df = pd.read_sql_query(query, con=engine)
df.head(10)

  customer_id               company_name            city      country
0       VINET  Vins et alcools Chevalier           Reims       France
1       TOMSP         Toms Spezialitäten         Münster      Germany
2       HANAR              Hanari Carnes  Rio de Janeiro       Brazil
3       VICTE       Victuailles en stock            Lyon       France
4       SUPRD           Suprêmes délices       Charleroi      Belgium
5       HANAR              Hanari Carnes  Rio de Janeiro       Brazil
6       CHOPS          Chop-suey Chinese            Bern  Switzerland
7       RICSU         Richter Supermarkt          Genève  Switzerland
8       WELLI     Wellington Importadora         Resende       Brazil
9       HILAA           HILARION-Abastos   San Cristóbal    Venezuela